/*
==============================================================================================
@ Title: Median
@ URL: https://www.acmicpc.net/problem/9782
@ Author: Sunghyouk Choi
@ Created Date: 2023. 2. 15. 오후 2:03:16
@ Level: Bronze 4
@ Tags: implementation math
@ Description:
ค่ามัธยฐาน หรือ Median คือค่ากึ่งกลางของกลุ่มข้อมูลที่เรียงลําดับ
นั่นคือจํานวนข้อมูลที่น้อยกว่าและมากกว่าค่ามัธย ฐานจะมีจํานวนเท่ากัน ให้
d1, d2, d3,... , dn คือข้อมูลทั้งหมด หาก n
เลขคี่ค่ามัธยฐานคือข้อมูลตําแหนงที่(n+1)/2 นั่นคือ Median = d(n+1)/2 แต่ถ้า
n เป็นเลขคู่ ค่ามัธยฐาน คือค่าเฉลี่ยของข้อมูลตําแหนงที่(n/2) และ(n/2)+1
นั่นคือ Median = (d(n/2) + d(n/2)+1) / 2
@ Input: แต่ละบรรทัดประกอบด้วยกลุ่มข้อมูล ซึ่งเป็นค่าตัวเลขจํานวนเต็มเรียงลําดับ
ค่าแรกของแต่ละบรรทัดคือจํานวนข้อมูลของกลุ่ม ข้อมูลนั้น ค่าข้อมูลมีค่าในช่วง
1 ถึง 106 อินพุตมีไม่เกิน 100 บรรทัด แต่ละบรรทัด มีข้อมูลไม่เกิน 100 ตัวค่า
0 บรรทัด สุดทัายเป็นจุดจบของอินพุต
@ Output: ให้พิมพ์ค่ามัธยฐานของข้อมูล ด้วยทศนิยม 1 ตําแหนงของแต่ละกลุ่ม ทีละบรรทัด
ตามลําดับ โดยแสดงคําว่า Case n: ไว้ ข้างหน้า ( n
คือลําดับกลุ่มข้อมูลเริ่มจาก 1) ให้ดูรูปแบบดังตัวอย่าง
==============================================================================================
*/
#include <iostream>
using namespace std;

int N, test;
int arr[100];

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);
  
    int N;
    cin >> N;

    while (N) {
        for (int i = 0; i < N; i++) cin >> arr[i];
        test++;
        cout << "Case " << test << ": ";
        int answer;
        if (N & 1) answer = arr[N/2] * 10;
        else answer = (arr[N/2 - 1] + arr[N/2]) * 5;
        cout << answer/10 << "." << answer%10 << '\n';

        cin >> N;
  }
    return 0;
}
